# Brewfile — core setup everyone gets.  `brew bundle --file=Brewfile`
# Personal/heavy tools (Flutter, Android, databases, …) live in Brewfile.personal.

tap "olets/tap"   # zsh-abbr

# ── Shell + prompt ────────────────────────────────────────────────────────────
brew "zsh"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "olets/tap/zsh-abbr"
brew "carapace"                 # argument-aware completions for 1000+ CLIs

# ── Core modern CLI ───────────────────────────────────────────────────────────
brew "fzf"                      # fuzzy finder
brew "zoxide"                   # smarter cd
brew "eza"                      # ls replacement
brew "bat"                      # cat with syntax highlighting
brew "fd"                       # find replacement
brew "ripgrep"                  # grep replacement
brew "git-delta"                # gorgeous git diffs
brew "lazygit"                  # git TUI
brew "atuin"                    # magical shell history
brew "fastfetch"                # system info
brew "chezmoi"                  # dotfiles manager (this repo)

# ── Chosen power-tools ────────────────────────────────────────────────────────
brew "dust"                     # du with bar charts
brew "procs"                    # ps replacement
brew "sd"                       # sed for humans
brew "jless"                    # interactive JSON viewer
brew "fx"                       # scriptable JSON
brew "glow"                     # render markdown in the terminal
brew "xh"                       # fast HTTPie-style HTTP client
brew "doggo"                    # modern dig (DNS)
brew "tealdeer"                 # tldr cheat-sheets (provides `tldr`)
brew "onefetch"                 # git repo "fetch" art
brew "gum"                      # build interactive shell scripts

# ── Essentials ────────────────────────────────────────────────────────────────
brew "git"
brew "gh"
brew "wget"
brew "jq"
brew "tree"

# ── Fun ───────────────────────────────────────────────────────────────────────
brew "lolcat"
brew "fortune"
brew "cmatrix"
brew "tty-clock"
brew "figlet"

# ── Fonts (Nerd Font powers the prompt icons) ─────────────────────────────────
cask "font-meslo-lg-nerd-font"
